var defaultFloorData = {
    spb_5: {
    "infra": [],
    "chairs": [
      {
        "id": "chair_1781225358930",
        "name": "1",
        "type": "workspace",
        "desc": "Новое рабочее место",
        "available": true,
        "x": 45.11627906976744,
        "y": 8.624130785756963
      },
      {
        "id": "chair_1781225368396",
        "name": "2",
        "type": "workspace",
        "desc": "Новое рабочее место",
        "available": true,
        "x": 45,
        "y": 11.878519761514308
      },
      {
        "id": "chair_1781225374247",
        "name": "3",
        "type": "workspace",
        "desc": "Новое рабочее место",
        "available": true,
        "x": 48.372093023255815,
        "y": 8.624130785756963
      },
      {
        "id": "chair_1781225383364",
        "name": "4",
        "type": "workspace",
        "desc": "Новое рабочее место",
        "available": true,
        "x": 48.604651162790695,
        "y": 11.71580031272644
      },
      {
        "id": "chair_1781225395497",
        "name": "5",
        "type": "workspace",
        "desc": "Новое рабочее место",
        "available": true,
        "x": 51.04651162790697,
        "y": 8.786850234544831
      },
      {
        "id": "chair_1781225400747",
        "name": "6",
        "type": "workspace",
        "desc": "Новое рабочее место",
        "available": true,
        "x": 54.30232558139535,
        "y": 8.949569683332697
      },
      {
        "id": "chair_1781225405314",
        "name": "7",
        "type": "workspace",
        "desc": "Новое рабочее место",
        "available": true,
        "x": 51.04651162790697,
        "y": 12.041239210302175
      },
      {
        "id": "chair_1781225410764",
        "name": "8",
        "type": "workspace",
        "desc": "Новое рабочее место",
        "available": true,
        "x": 54.30232558139535,
        "y": 11.878519761514308
      },
      {
        "id": "chair_1781225419448",
        "name": "9",
        "type": "workspace",
        "desc": "Новое рабочее место",
        "available": true,
        "x": 44.883720930232556,
        "y": 16.43466432757459
      },
      {
        "id": "chair_1781225424498",
        "name": "10",
        "type": "workspace",
        "desc": "Новое рабочее место",
        "available": true,
        "x": 45,
        "y": 19.200894956968334
      },
      {
        "id": "chair_1781225429448",
        "name": "11",
        "type": "workspace",
        "desc": "Новое рабочее место",
        "available": true,
        "x": 48.25581395348838,
        "y": 16.597383776362456
      },
      {
        "id": "chair_1781225433897",
        "name": "12",
        "type": "workspace",
        "desc": "Новое рабочее место",
        "available": true,
        "x": 48.372093023255815,
        "y": 19.526333854544067
      },
      {
        "id": "chair_1781225449948",
        "name": "13",
        "type": "workspace",
        "desc": "Новое рабочее место",
        "available": true,
        "x": 44.883720930232556,
        "y": 23.106161727877147
      },
      {
        "id": "chair_1781225454131",
        "name": "14",
        "type": "workspace",
        "desc": "Новое рабочее место",
        "available": true,
        "x": 45,
        "y": 26.035111806058758
      },
      {
        "id": "chair_1781225458948",
        "name": "15",
        "type": "workspace",
        "desc": "Новое рабочее место",
        "available": true,
        "x": 48.372093023255815,
        "y": 23.268881176665012
      },
      {
        "id": "chair_1781225465898",
        "name": "16",
        "type": "workspace",
        "desc": "Новое рабочее место",
        "available": true,
        "x": 48.48837209302326,
        "y": 26.360550703634487
      },
      {
        "id": "chair_1781225470631",
        "name": "17",
        "type": "workspace",
        "desc": "Новое рабочее место",
        "available": true,
        "x": 50.813953488372086,
        "y": 23.106161727877147
      },
      {
        "id": "chair_1781225474948",
        "name": "18",
        "type": "workspace",
        "desc": "Новое рабочее место",
        "available": true,
        "x": 50.46511627906977,
        "y": 26.035111806058758
      },
      {
        "id": "chair_1781225479648",
        "name": "19",
        "type": "workspace",
        "desc": "Новое рабочее место",
        "available": true,
        "x": 53.604651162790695,
        "y": 23.106161727877147
      },
      {
        "id": "chair_1781225488482",
        "name": "20",
        "type": "workspace",
        "desc": "Новое рабочее место",
        "available": true,
        "x": 53.48837209302325,
        "y": 26.035111806058758
      },
      {
        "id": "chair_1781225495699",
        "name": "21",
        "type": "workspace",
        "desc": "Новое рабочее место",
        "available": true,
        "x": 19.767441860465116,
        "y": 31.73029251363411
      },
      {
        "id": "chair_1781225502032",
        "name": "22",
        "type": "workspace",
        "desc": "Новое рабочее место",
        "available": true,
        "x": 19.767441860465116,
        "y": 34.49652314302785
      },
      {
        "id": "chair_1781225507832",
        "name": "23",
        "type": "workspace",
        "desc": "Новое рабочее место",
        "available": true,
        "x": 22.906976744186046,
        "y": 31.73029251363411
      },
      {
        "id": "chair_1781225514515",
        "name": "24",
        "type": "workspace",
        "desc": "Новое рабочее место",
        "available": true,
        "x": 23.13953488372093,
        "y": 34.65924259181572
      },
      {
        "id": "chair_1781225521115",
        "name": "25",
        "type": "workspace",
        "desc": "Новое рабочее место",
        "available": true,
        "x": 25.116279069767444,
        "y": 31.73029251363411
      },
      {
        "id": "chair_1781225527066",
        "name": "26",
        "type": "workspace",
        "desc": "Новое рабочее место",
        "available": true,
        "x": 27.790697674418606,
        "y": 31.73029251363411
      },
      {
        "id": "chair_1781225532199",
        "name": "27",
        "type": "workspace",
        "desc": "Новое рабочее место",
        "available": true,
        "x": 25.232558139534884,
        "y": 34.33380369423998
      },
      {
        "id": "chair_1781225539549",
        "name": "28",
        "type": "workspace",
        "desc": "Новое рабочее место",
        "available": true,
        "x": 27.906976744186046,
        "y": 34.65924259181572
      },
      {
        "id": "chair_1781225547099",
        "name": "29",
        "type": "workspace",
        "desc": "Новое рабочее место",
        "available": true,
        "x": 30.116279069767444,
        "y": 30.75397582090691
      },
      {
        "id": "chair_1781225552066",
        "name": "30",
        "type": "workspace",
        "desc": "Новое рабочее место",
        "available": true,
        "x": 29.88372093023256,
        "y": 34.00836479666425
      },
      {
        "id": "chair_1781225557966",
        "name": "31",
        "type": "workspace",
        "desc": "Новое рабочее место",
        "available": true,
        "x": 32.79069767441861,
        "y": 30.75397582090691
      },
      {
        "id": "chair_1781225565333",
        "name": "32",
        "type": "workspace",
        "desc": "Новое рабочее место",
        "available": true,
        "x": 33.02325581395349,
        "y": 33.68292589908852
      },
      {
        "id": "chair_1781225569666",
        "name": "33",
        "type": "workspace",
        "desc": "Новое рабочее место",
        "available": true,
        "x": 35,
        "y": 31.567573064846243
      },
      {
        "id": "chair_1781225574600",
        "name": "34",
        "type": "workspace",
        "desc": "Новое рабочее место",
        "available": true,
        "x": 35,
        "y": 34.33380369423998
      },
      {
        "id": "chair_1781225579532",
        "name": "35",
        "type": "workspace",
        "desc": "Новое рабочее место",
        "available": true,
        "x": 38.02325581395349,
        "y": 31.567573064846243
      },
      {
        "id": "chair_1781225584316",
        "name": "36",
        "type": "workspace",
        "desc": "Новое рабочее место",
        "available": true,
        "x": 37.7906976744186,
        "y": 34.49652314302785
      },
      {
        "id": "chair_1781225591483",
        "name": "37",
        "type": "workspace",
        "desc": "Новое рабочее место",
        "available": true,
        "x": 39.883720930232556,
        "y": 31.89301196242198
      },
      {
        "id": "chair_1781225596016",
        "name": "38",
        "type": "workspace",
        "desc": "Новое рабочее место",
        "available": true,
        "x": 42.906976744186046,
        "y": 31.89301196242198
      },
      {
        "id": "chair_1781225602916",
        "name": "39",
        "type": "workspace",
        "desc": "Новое рабочее место",
        "available": true,
        "x": 40,
        "y": 34.65924259181572
      },
      {
        "id": "chair_1781225607217",
        "name": "40",
        "type": "workspace",
        "desc": "Новое рабочее место",
        "available": true,
        "x": 43.02325581395349,
        "y": 34.65924259181572
      },
      {
        "id": "chair_1781225611767",
        "name": "41",
        "type": "workspace",
        "desc": "Новое рабочее место",
        "available": true,
        "x": 45,
        "y": 31.89301196242198
      },
      {
        "id": "chair_1781225615950",
        "name": "42",
        "type": "workspace",
        "desc": "Новое рабочее место",
        "available": true,
        "x": 45,
        "y": 34.49652314302785
      },
      {
        "id": "chair_1781225620067",
        "name": "43",
        "type": "workspace",
        "desc": "Новое рабочее место",
        "available": true,
        "x": 48.13953488372093,
        "y": 31.89301196242198
      },
      {
        "id": "chair_1781225625917",
        "name": "44",
        "type": "workspace",
        "desc": "Новое рабочее место",
        "available": true,
        "x": 48.25581395348838,
        "y": 34.82196204060359
      },
      {
        "id": "chair_1781225630601",
        "name": "45",
        "type": "workspace",
        "desc": "Новое рабочее место",
        "available": true,
        "x": 50.46511627906977,
        "y": 31.73029251363411
      },
      {
        "id": "chair_1781225634984",
        "name": "46",
        "type": "workspace",
        "desc": "Новое рабочее место",
        "available": true,
        "x": 50.46511627906977,
        "y": 34.65924259181572
      },
      {
        "id": "chair_1781225638634",
        "name": "47",
        "type": "workspace",
        "desc": "Новое рабочее место",
        "available": true,
        "x": 53.83720930232558,
        "y": 31.73029251363411
      },
      {
        "id": "chair_1781225644234",
        "name": "48",
        "type": "workspace",
        "desc": "Новое рабочее место",
        "available": true,
        "x": 53.604651162790695,
        "y": 34.49652314302785
      },
      {
        "id": "chair_1781225648817",
        "name": "49",
        "type": "workspace",
        "desc": "Новое рабочее место",
        "available": true,
        "x": 56.97674418604651,
        "y": 31.567573064846243
      },
      {
        "id": "chair_1781225653567",
        "name": "50",
        "type": "workspace",
        "desc": "Новое рабочее место",
        "available": true,
        "x": 56.97674418604651,
        "y": 34.49652314302785
      },
      {
        "id": "chair_1781225658734",
        "name": "51",
        "type": "workspace",
        "desc": "Новое рабочее место",
        "available": true,
        "x": 60.23255813953489,
        "y": 31.567573064846243
      },
      {
        "id": "chair_1781225663534",
        "name": "52",
        "type": "workspace",
        "desc": "Новое рабочее место",
        "available": true,
        "x": 60.23255813953489,
        "y": 34.49652314302785
      },
      {
        "id": "chair_1781225668267",
        "name": "53",
        "type": "workspace",
        "desc": "Новое рабочее место",
        "available": true,
        "x": 62.2093023255814,
        "y": 31.73029251363411
      },
      {
        "id": "chair_1781225672701",
        "name": "54",
        "type": "workspace",
        "desc": "Новое рабочее место",
        "available": true,
        "x": 62.2093023255814,
        "y": 34.33380369423998
      },
      {
        "id": "chair_1781225678251",
        "name": "55",
        "type": "workspace",
        "desc": "Новое рабочее место",
        "available": true,
        "x": 65.23255813953487,
        "y": 31.89301196242198
      },
      {
        "id": "chair_1781225683501",
        "name": "56",
        "type": "workspace",
        "desc": "Новое рабочее место",
        "available": true,
        "x": 65.23255813953487,
        "y": 34.49652314302785
      },
      {
        "id": "chair_1781225729151",
        "name": "57",
        "type": "workspace",
        "desc": "Новое рабочее место",
        "available": true,
        "x": 38.83720930232558,
        "y": 52.070223612117516
      },
      {
        "id": "chair_1781225733535",
        "name": "58",
        "type": "workspace",
        "desc": "Новое рабочее место",
        "available": true,
        "x": 41.86046511627907,
        "y": 52.23294306090538
      },
      {
        "id": "chair_1781225741368",
        "name": "59",
        "type": "workspace",
        "desc": "Новое рабочее место",
        "available": true,
        "x": 38.83720930232558,
        "y": 55.812770934238465
      },
      {
        "id": "chair_1781225752018",
        "name": "60",
        "type": "workspace",
        "desc": "Новое рабочее место",
        "available": true,
        "x": 41.97674418604651,
        "y": 55.975490383026326
      },
      {
        "id": "chair_1781225756369",
        "name": "61",
        "type": "workspace",
        "desc": "Новое рабочее место",
        "available": true,
        "x": 44.651162790697676,
        "y": 52.558381958481114
      },
      {
        "id": "chair_1781225760619",
        "name": "62",
        "type": "workspace",
        "desc": "Новое рабочее место",
        "available": true,
        "x": 47.7906976744186,
        "y": 52.39566250969325
      },
      {
        "id": "chair_1781225764768",
        "name": "63",
        "type": "workspace",
        "desc": "Новое рабочее место",
        "available": true,
        "x": 44.76744186046512,
        "y": 55.65005148545059
      },
      {
        "id": "chair_1781225769051",
        "name": "64",
        "type": "workspace",
        "desc": "Новое рабочее место",
        "available": true,
        "x": 47.906976744186046,
        "y": 55.812770934238465
      },
      {
        "id": "chair_1781225773652",
        "name": "65",
        "type": "workspace",
        "desc": "Новое рабочее место",
        "available": true,
        "x": 78.83720930232559,
        "y": 49.46671243151164
      },
      {
        "id": "chair_1781225778502",
        "name": "66",
        "type": "workspace",
        "desc": "Новое рабочее место",
        "available": true,
        "x": 81.04651162790698,
        "y": 49.46671243151164
      },
      {
        "id": "chair_1781225782752",
        "name": "67",
        "type": "workspace",
        "desc": "Новое рабочее место",
        "available": true,
        "x": 78.72093023255815,
        "y": 54.51101534393552
      },
      {
        "id": "chair_1781225791602",
        "name": "68",
        "type": "workspace",
        "desc": "Новое рабочее место",
        "available": true,
        "x": 81.16279069767441,
        "y": 54.673734792723394
      },
      {
        "id": "chair_1781225810752",
        "name": "69",
        "type": "workspace",
        "desc": "Новое рабочее место",
        "available": true,
        "x": 78.6046511627907,
        "y": 65.08777951514689
      },
      {
        "id": "chair_1781225815619",
        "name": "70",
        "type": "workspace",
        "desc": "Новое рабочее место",
        "available": true,
        "x": 78.83720930232559,
        "y": 59.5553182563594
      },
      {
        "id": "chair_1781225819919",
        "name": "71",
        "type": "workspace",
        "desc": "Новое рабочее место",
        "available": true,
        "x": 80.93023255813954,
        "y": 59.5553182563594
      },
      {
        "id": "chair_1781225825236",
        "name": "72",
        "type": "workspace",
        "desc": "Новое рабочее место",
        "available": true,
        "x": 81.16279069767441,
        "y": 65.08777951514689
      },
      {
        "id": "chair_1781225834536",
        "name": "73",
        "type": "workspace",
        "desc": "Новое рабочее место",
        "available": true,
        "x": 78.72093023255815,
        "y": 68.66760738847996
      },
      {
        "id": "chair_1781225840653",
        "name": "74",
        "type": "workspace",
        "desc": "Новое рабочее место",
        "available": true,
        "x": 81.04651162790698,
        "y": 68.66760738847996
      },
      {
        "id": "chair_1781225853269",
        "name": "75",
        "type": "workspace",
        "desc": "Новое рабочее место",
        "available": true,
        "x": 78.6046511627907,
        "y": 74.03734919847959
      },
      {
        "id": "chair_1781225862419",
        "name": "76",
        "type": "workspace",
        "desc": "Новое рабочее место",
        "available": true,
        "x": 81.04651162790698,
        "y": 74.03734919847959
      },
      {
        "id": "chair_1781225867987",
        "name": "77",
        "type": "workspace",
        "desc": "Новое рабочее место",
        "available": true,
        "x": 78.83720930232559,
        "y": 77.4544576230248
      },
      {
        "id": "chair_1781225873153",
        "name": "78",
        "type": "workspace",
        "desc": "Новое рабочее место",
        "available": true,
        "x": 81.04651162790698,
        "y": 77.4544576230248
      },
      {
        "id": "chair_1781225879103",
        "name": "79",
        "type": "workspace",
        "desc": "Новое рабочее место",
        "available": true,
        "x": 78.72093023255815,
        "y": 82.66147998423655
      },
      {
        "id": "chair_1781225884636",
        "name": "80",
        "type": "workspace",
        "desc": "Новое рабочее место",
        "available": true,
        "x": 81.04651162790698,
        "y": 82.66147998423655
      },
      {
        "id": "chair_1781225890820",
        "name": "81",
        "type": "workspace",
        "desc": "Новое рабочее место",
        "available": true,
        "x": 78.6046511627907,
        "y": 86.4040273063575
      },
      {
        "id": "chair_1781225896853",
        "name": "82",
        "type": "workspace",
        "desc": "Новое рабочее место",
        "available": true,
        "x": 81.04651162790698,
        "y": 86.24130785756964
      },
      {
        "id": "chair_1781225901837",
        "name": "83",
        "type": "workspace",
        "desc": "Новое рабочее место",
        "available": true,
        "x": 78.6046511627907,
        "y": 91.93648856514498
      },
      {
        "id": "chair_1781225906470",
        "name": "84",
        "type": "workspace",
        "desc": "Новое рабочее место",
        "available": true,
        "x": 81.04651162790698,
        "y": 91.93648856514498
      },
      {
        "id": "chair_1781225911820",
        "name": "85",
        "type": "workspace",
        "desc": "Новое рабочее место",
        "available": true,
        "x": 69.88372093023256,
        "y": 83.47507722817589
      },
      {
        "id": "chair_1781225917087",
        "name": "86",
        "type": "workspace",
        "desc": "Новое рабочее место",
        "available": true,
        "x": 72.09302325581395,
        "y": 83.47507722817589
      },
      {
        "id": "chair_1781225942538",
        "name": "87",
        "type": "workspace",
        "desc": "Новое рабочее место",
        "available": true,
        "x": 69.76744186046511,
        "y": 88.8448190381755
      },
      {
        "id": "chair_1781225948021",
        "name": "88",
        "type": "workspace",
        "desc": "Новое рабочее место",
        "available": true,
        "x": 72.20930232558139,
        "y": 88.8448190381755
      }
    ],
    "meetingRooms": [
      {
        "id": "meeting_room_1781226320945",
        "name": "Новая переговорная",
        "desc": "Переговорная",
        "available": true,
        "x": 45.46511627906977,
        "y": 81.84788274029722,
        "capacity": 8,
        "hasProjector": true,
        "type": "meeting_room",
        "label": "👥"
      },
      {
        "id": "meeting_room_1781226329696",
        "name": "Новая переговорная",
        "desc": "Переговорная",
        "available": true,
        "x": 54.18604651162791,
        "y": 81.68516329150935,
        "capacity": 8,
        "hasProjector": true,
        "type": "meeting_room",
        "label": "👥"
      }
    ],
    "recreation": [
      {
        "id": "tennis_1781226336512",
        "name": "Настольный теннис",
        "desc": "Зона отдыха",
        "available": true,
        "x": 62.32558139534884,
        "y": 57.602684870904994,
        "type": "tennis",
        "label": "🏓"
      },
      {
        "id": "playstation_1781226343046",
        "name": "PlayStation",
        "desc": "Зона отдыха",
        "available": true,
        "x": 62.906976744186046,
        "y": 82.4987605354487,
        "type": "playstation",
        "label": "🎮"
      },
      {
        "id": "massage_1781226373796",
        "name": "Массажное кресло",
        "desc": "Зона отдыха",
        "available": true,
        "x": 62.441860465116285,
        "y": 67.85401014454064,
        "type": "massage",
        "label": "💆"
      }
    ]
  },
  spb_3: {
    "infra": [],
    "chairs": [{"id":"chair_1781224837676","name":"1","type":"workspace","desc":"Новое рабочее место","available":true,"x":34.418604651162795,"y":28.15046464030103},{"id":"chair_1781224851976","name":"2","type":"workspace","desc":"Новое рабочее место","available":true,"x":34.30232558139535,"y":33.52020645030065},{"id":"chair_1781224862976","name":"3","type":"workspace","desc":"Новое рабочее место","available":true,"x":34.418604651162795,"y":38.889948260300265},{"id":"chair_1781224871060","name":"4","type":"workspace","desc":"Новое рабочее место","available":true,"x":34.18604651162791,"y":43.93425117272415},{"id":"chair_1781224880860","name":"5","type":"workspace","desc":"Новое рабочее место","available":true,"x":15,"y":56.13820983181419},{"id":"chair_1781224887526","name":"6","type":"workspace","desc":"Новое рабочее место","available":true,"x":18.83720930232558,"y":56.13820983181419},{"id":"chair_1781224909608","name":"7","type":"workspace","desc":"Новое рабочее место","available":true,"x":22.674418604651162,"y":56.13820983181419},{"id":"chair_1781224919375","name":"8","type":"workspace","desc":"Новое рабочее место","available":true,"x":26.51162790697674,"y":56.30092928060206},{"id":"chair_1781224925992","name":"9","type":"workspace","desc":"Новое рабочее место","available":true,"x":15,"y":63.78602392484396},{"id":"chair_1781224932941","name":"10","type":"workspace","desc":"Новое рабочее место","available":true,"x":18.953488372093023,"y":63.623304476056084},{"id":"chair_1781224939458","name":"11","type":"workspace","desc":"Новое рабочее место","available":true,"x":22.674418604651162,"y":63.623304476056084},{"id":"chair_1781224946492","name":"12","type":"workspace","desc":"Новое рабочее место","available":true,"x":26.395348837209305,"y":63.623304476056084},{"id":"chair_1781224952975","name":"13","type":"workspace","desc":"Новое рабочее место","available":true,"x":38.02325581395349,"y":27.987745191513163},{"id":"chair_1781224973392","name":"14","type":"workspace","desc":"Новое рабочее место","available":true,"x":38.02325581395349,"y":33.52020645030065},{"id":"chair_1781224981509","name":"15","type":"workspace","desc":"Новое рабочее место","available":true,"x":38.139534883720934,"y":38.889948260300265},{"id":"chair_1781224992109","name":"16","type":"workspace","desc":"Новое рабочее место","available":true,"x":38.25581395348837,"y":44.09697062151202},{"id":"chair_1781225025027","name":"17","type":"workspace","desc":"Новое рабочее место","available":true,"x":38.139534883720934,"y":49.46671243151164},{"id":"chair_1781225047509","name":"18","type":"workspace","desc":"Новое рабочее место","available":true,"x":38.372093023255815,"y":54.836454241511255},{"id":"chair_1781225054427","name":"19","type":"workspace","desc":"Новое рабочее место","available":true,"x":43.48837209302325,"y":28.3131840890889},{"id":"chair_1781225059327","name":"20","type":"workspace","desc":"Новое рабочее место","available":true,"x":43.604651162790695,"y":33.52020645030065},{"id":"chair_1781225064493","name":"21","type":"workspace","desc":"Новое рабочее место","available":true,"x":43.604651162790695,"y":38.889948260300265},{"id":"chair_1781225072260","name":"22","type":"workspace","desc":"Новое рабочее место","available":true,"x":43.48837209302325,"y":44.25969007029988},{"id":"chair_1781225080427","name":"23","type":"workspace","desc":"Новое рабочее место","available":true,"x":43.372093023255815,"y":49.46671243151164},{"id":"chair_1781225084660","name":"24","type":"workspace","desc":"Новое рабочее место","available":true,"x":43.48837209302325,"y":54.836454241511255},{"id":"chair_1781225089310","name":"25","type":"workspace","desc":"Новое рабочее место","available":true,"x":33.72093023255814,"y":66.0640962078741},{"id":"chair_1781225094927","name":"26","type":"workspace","desc":"Новое рабочее место","available":true,"x":47.44186046511628,"y":32.21845085999771},{"id":"chair_1781225099660","name":"27","type":"workspace","desc":"Новое рабочее место","available":true,"x":47.55813953488372,"y":37.425473221209465},{"id":"chair_1781225104744","name":"28","type":"workspace","desc":"Новое рабочее место","available":true,"x":52.55813953488372,"y":27.662306293937426},{"id":"chair_1781225109944","name":"29","type":"workspace","desc":"Новое рабочее место","available":true,"x":52.674418604651166,"y":33.03204810393705},{"id":"chair_1781225114994","name":"30","type":"workspace","desc":"Новое рабочее место","available":true,"x":52.674418604651166,"y":38.40178991393667},{"id":"chair_1781225119644","name":"31","type":"workspace","desc":"Новое рабочее место","available":true,"x":52.79069767441861,"y":43.608812275148416},{"id":"chair_1781225124077","name":"32","type":"workspace","desc":"Новое рабочее место","available":true,"x":52.674418604651166,"y":49.1412735339359},{"id":"chair_1781225128910","name":"33","type":"workspace","desc":"Новое рабочее место","available":true,"x":47.44186046511628,"y":48.97855408514803},{"id":"chair_1781225133477","name":"34","type":"workspace","desc":"Новое рабочее место","available":true,"x":47.55813953488372,"y":54.34829589514766},{"id":"chair_1781225139177","name":"35","type":"workspace","desc":"Новое рабочее место","available":true,"x":52.79069767441861,"y":54.673734792723394},{"id":"chair_1781225144294","name":"36","type":"workspace","desc":"Новое рабочее место","available":true,"x":47.44186046511628,"y":59.880757153935136},{"id":"chair_1781225149928","name":"37","type":"workspace","desc":"Новое рабочее место","available":true,"x":52.55813953488372,"y":59.718037705147275},{"id":"chair_1781225159594","name":"38","type":"workspace","desc":"Новое рабочее место","available":true,"x":56.860465116279066,"y":27.825025742725295},{"id":"chair_1781225164511","name":"39","type":"workspace","desc":"Новое рабочее место","available":true,"x":56.860465116279066,"y":33.03204810393705},{"id":"chair_1781225172028","name":"40","type":"workspace","desc":"Новое рабочее место","available":true,"x":56.860465116279066,"y":38.2390704651488},{"id":"chair_1781225177695","name":"41","type":"workspace","desc":"Новое рабочее место","available":true,"x":56.860465116279066,"y":43.608812275148416},{"id":"chair_1781225185361","name":"42","type":"workspace","desc":"Новое рабочее место","available":true,"x":56.74418604651162,"y":48.97855408514803},{"id":"chair_1781225193078","name":"43","type":"workspace","desc":"Новое рабочее место","available":true,"x":56.860465116279066,"y":54.18557644635978},{"id":"chair_1781225198528","name":"44","type":"workspace","desc":"Новое рабочее место","available":true,"x":56.97674418604651,"y":59.5553182563594},{"id":"chair_1781225202761","name":"45","type":"workspace","desc":"Новое рабочее место","available":true,"x":61.9767441860465,"y":27.825025742725295},{"id":"chair_1781225208145","name":"46","type":"workspace","desc":"Новое рабочее место","available":true,"x":62.093023255813954,"y":33.19476755272491},{"id":"chair_1781225212845","name":"47","type":"workspace","desc":"Новое рабочее место","available":true,"x":61.9767441860465,"y":38.564509362724536},{"id":"chair_1781225218328","name":"48","type":"workspace","desc":"Новое рабочее место","available":true,"x":62.093023255813954,"y":44.09697062151202},{"id":"chair_1781225222578","name":"49","type":"workspace","desc":"Новое рабочее место","available":true,"x":62.093023255813954,"y":49.30399298272377},{"id":"chair_1781225226662","name":"50","type":"workspace","desc":"Новое рабочее место","available":true,"x":61.9767441860465,"y":54.673734792723394},{"id":"chair_1781225234462","name":"51","type":"workspace","desc":"Новое рабочее место","available":true,"x":62.2093023255814,"y":59.880757153935136},{"id":"chair_1781225241012","name":"52","type":"workspace","desc":"Новое рабочее место","available":true,"x":65.11627906976744,"y":27.01142849878596},{"id":"chair_1781225247162","name":"53","type":"workspace","desc":"Новое рабочее место","available":true,"x":65,"y":32.543889757573446},{"id":"chair_1781225251679","name":"54","type":"workspace","desc":"Новое рабочее место","available":true,"x":65,"y":37.91363156757306},{"id":"chair_1781225257512","name":"55","type":"workspace","desc":"Новое рабочее место","available":true,"x":65.11627906976744,"y":42.95793447999695},{"id":"chair_1781225262162","name":"56","type":"workspace","desc":"Новое рабочее место","available":true,"x":65.11627906976744,"y":48.32767628999657},{"id":"chair_1781225266229","name":"57","type":"workspace","desc":"Новое рабочее место","available":true,"x":65,"y":53.860137548784046},{"id":"chair_1781225270746","name":"58","type":"workspace","desc":"Новое рабочее место","available":true,"x":65.11627906976744,"y":59.39259880757154},{"id":"chair_1781225276129","name":"59","type":"workspace","desc":"Новое рабочее место","available":true,"x":70.69767441860465,"y":37.588192669997326},{"id":"chair_1781225281162","name":"60","type":"workspace","desc":"Новое рабочее место","available":true,"x":70.46511627906978,"y":48.490395738784436},{"id":"chair_1781225286130","name":"61","type":"workspace","desc":"Новое рабочее место","available":true,"x":70.34883720930233,"y":53.860137548784046},{"id":"chair_1781225291396","name":"62","type":"workspace","desc":"Новое рабочее место","available":true,"x":70.34883720930233,"y":59.22987935878368},{"id":"chair_1781225299780","name":"63","type":"workspace","desc":"Новое рабочее место","available":true,"x":37.7906976744186,"y":65.90137675908623},{"id":"chair_1781225304829","name":"64","type":"workspace","desc":"Новое рабочее место","available":true,"x":41.3953488372093,"y":66.22681565666197},{"id":"chair_1781225316546","name":"65","type":"workspace","desc":"Новое рабочее место","available":true,"x":45.23255813953489,"y":66.22681565666197},{"id":"chair_1781225325913","name":"66","type":"workspace","desc":"Новое рабочее место","available":true,"x":76.04651162790698,"y":59.5553182563594},{"id":"chair_1781225333312","name":"67","type":"workspace","desc":"Новое рабочее место","available":true,"x":80.11627906976744,"y":51.90750416332964}],
    "meetingRooms": [{"id":"meeting_room_1781226403096","name":"Новая переговорная","desc":"Переговорная","available":true,"x":20,"y":75.0136658912068,"capacity":8,"hasProjector":true,"type":"meeting_room","label":"👥"}],
    "recreation": []
  }
};